test_playbook/expects/book_9_until_and_retry.puml
@startuml
state "= Play: Until and retries" as play_1 {
    play_1 : | hosts | localhost |
    state "== Wait for response" as task_1
    task_1 : Action **ping**
    task_1 : ....
    task_1 : **register** //result//
    state task_1_until <<choice>>
    note right of task_1_until
        **until**: result is success
        **retres**: 3
        **delay**: 10 (seconds)
    end note
    state "== Do something" as task_2
    task_2 : Action **debug**
    task_2 : | msg | The server is available !! |
}
[*] --> task_1
task_1_until --> task_2
task_1 --> task_1_until
task_1_until --> task_1 : retry
task_2 --> [*]
@enduml
